# DimStyleCenterlineSymbol Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimStyleCenterlineSymbol Property
ParameterTypeId Class See Also
---
"Centerline Symbol"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimStyleCenterlineSymbol { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimStyleCenterlineSymbol As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimStyleCenterlineSymbol {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace